result/local-11k-1593689699.txt
wrk -t4 -c20 -d30s -R500 --latency http://192.168.1.4/index.html
Running 30s test @ http://192.168.1.4/index.html
  4 threads and 20 connections
  Thread calibration: mean lat.: 1.017ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.952ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.049ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.961ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  359.29us   2.82ms   66.40%
    Req/Sec   131.37     88.23   333.00     55.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%       1.12 ms
 75.000%       1.35 ms
 90.000%       1.51 ms
 99.000%       1.92 ms
 99.900%       2.10 ms
 99.990%       2.31 ms
 99.999%       2.83 ms
100.000%       2.83 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.218     0.000000            1         1.00
       0.574     0.100000         1001         1.11
       0.749     0.200000         1999         1.25
       0.884     0.300000         2995         1.43
       1.007     0.400000         3994         1.67
       1.118     0.500000         4991         2.00
       1.167     0.550000         5490         2.22
       1.214     0.600000         5993         2.50
       1.258     0.650000         6492         2.86
       1.300     0.700000         6997         3.33
       1.348     0.750000         7496         4.00
       1.371     0.775000         7735         4.44
       1.396     0.800000         7987         5.00
       1.421     0.825000         8243         5.71
       1.445     0.850000         8487         6.67
       1.471     0.875000         8734         8.00
       1.491     0.887500         8858         8.89
       1.513     0.900000         8982        10.00
       1.537     0.912500         9109        11.43
       1.564     0.925000         9232        13.33
       1.601     0.937500         9358        16.00
       1.620     0.943750         9421        17.78
       1.642     0.950000         9481        20.00
       1.666     0.956250         9547        22.86
       1.686     0.962500         9609        26.67
       1.722     0.968750         9670        32.00
       1.736     0.971875         9701        35.56
       1.759     0.975000         9733        40.00
       1.781     0.978125         9763        45.71
       1.806     0.981250         9793        53.33
       1.837     0.984375         9825        64.00
       1.851     0.985938         9840        71.11
       1.874     0.987500         9856        80.00
       1.896     0.989062         9871        91.43
       1.931     0.990625         9888       106.67
       1.951     0.992188         9904       128.00
       1.959     0.992969         9910       142.22
       1.980     0.993750         9918       160.00
       1.994     0.994531         9926       182.86
       2.007     0.995313         9934       213.33
       2.023     0.996094         9942       256.00
       2.029     0.996484         9946       284.44
       2.032     0.996875         9949       320.00
       2.042     0.997266         9954       365.71
       2.051     0.997656         9958       426.67
       2.061     0.998047         9961       512.00
       2.067     0.998242         9964       568.89
       2.071     0.998437         9966       640.00
       2.077     0.998633         9967       731.43
       2.097     0.998828         9969       853.33
       2.115     0.999023         9972      1024.00
       2.115     0.999121         9972      1137.78
       2.119     0.999219         9973      1280.00
       2.123     0.999316         9974      1462.86
       2.137     0.999414         9975      1706.67
       2.161     0.999512         9976      2048.00
       2.161     0.999561         9976      2275.56
       2.201     0.999609         9977      2560.00
       2.201     0.999658         9977      2925.71
       2.279     0.999707         9978      3413.33
       2.279     0.999756         9978      4096.00
       2.279     0.999780         9978      4551.11
       2.315     0.999805         9979      5120.00
       2.315     0.999829         9979      5851.43
       2.315     0.999854         9979      6826.67
       2.315     0.999878         9979      8192.00
       2.315     0.999890         9979      9102.22
       2.825     0.999902         9980     10240.00
       2.825     1.000000         9980          inf
#[Mean    =        1.085, StdDeviation   =        0.359]
#[Max     =        2.824, Total count    =         9980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15004 requests in 30.00s, 159.88MB read
Requests/sec:    500.10
Transfer/sec:      5.33MB
wrk -t4 -c100 -d30s -R500 --latency http://192.168.1.4/index.html